Repository: Eckorezze/botfortrpp
Catalog: locales/*/LC_MESSAGES/bot.po
Languages: ru

source: ↩️Cancel
ru: ↩️Отмена

source: Search user by:
ru: Искать пользователя по:

source: Type user {search}:
ru: Введите {search} пользователя:

source: Enter in Conversation
ru: Начать общение с

source: Write as a bot
ru: Написать как бот

source: ❌Ban
ru: ❌Забанить

source: ✅Unban
ru: ✅Разбанить

source: 🔙Back
ru: 🔙Назад

source: User not found!
ru: Пользователь не найден!

source: Enter ban reason:
ru: Введите причину бана:

source: Please type your answer:
ru: Пожалуйста, введите ваш ответ:

source: Your message *{message_id}* was seen! *Answer:* `{answer}`
ru: Ваше сообщение *{message_id}* было просмотрено! *Ответ:* `{answer}`

source: Your answer sent!
ru: Ваш ответ отправлен!

source: Something went wrong, see log for more information!
ru: Что-то пошло не так, см. журнал для получения дополнительной информации!

source: Please type message:
ru: Пожалуйста, введите сообщение:

source: Your message sent!
ru: Ваше сообщение отправлено!

source: Hi, this is the entertainment section!
ru: Привет, это раздел развлечений!

source: The dice rolled *{dice_result}*
ru: На кубике выпало *{dice_result}*

source: Choose the type of QR code:
ru: Выберите тип QR-кода:

source: 📂Menu
ru: 📂Меню

source: Simple QR code
ru: Простой QR код

source: Enter URL:
ru: Введите URL:

source: Wi-Fi QR-code
ru: Wi-Fi QR-код

source: Enter the Wi-Fi network name:
ru: Введите название сети Wi-Fi:

source: Enter Wi-Fi password:
ru: Введите пароль от Wi-Fi:

source: Select the color of the QR code.
ru: Выберите цвет QR-кода.

source: Now choose a background color.
ru: Теперь выберите цвет фона.

source: You can't choose the same color twice! Choose the colors again.
ru: Вы не можете выбрать тот же цвет дважды! Выберите цвета снова.

source: Scan the QR code
ru: Отсканируйте QR код

source: Please enter password length:
ru: Пожалуйста, введите длину пароля:

source: Password can't be greater than 64 symbols
ru: Пароль не может быть длиннее 64 символов

source: Please enter correct numbers:
ru: Пожалуйста, введите корректные числа:

source: Here are your password: `{password}`
ru: Вот ваш пароль: `{password}`

source: Please enter a number:
ru: Пожалуйста, введите число:

source: Hi enter range of numbers by -, or select one from examples.
ru: Привет, введите диапазон чисел через - или выберите один из примеров.

source: Your number is `{number}`
ru: Ваш номер - `{number}`

source: *Your tasks:*
ru: *Ваши задачи:*

source: ➕Add task
ru: ➕Добавить задачу

source: You haven't tasks.
ru: У вас нет задач.

source: Hi, here are your tasks!
ru: Привет, вот ваши задачи!

source: ❌Delete
ru: ❌Удалить

source: Enter your task:
ru: Введите вашу задачу:

source: Task deleted.
ru: Задача удалена.

source: Task added.
ru: Задача добавлена.

source: Hi! I'm your bot for TRPP.
ru: Привет! Я твой бот для ТРПП.

source: Please choose your language!
ru: Пожалуйста, выберите свой язык!

source: Please share your location
ru: Пожалуйста, поделитесь своим местоположением

source: What do you want to get?
ru: Что вы хотите получить?

source: Current weather
ru: Текущая погода

source: <b>Location: %s</b> Weather: %s Weather description: %s Temperature: %s°C
ru: <b>Местоположение: %s</b> Погода: %s Описание погоды: %s Температура: %s°C

source: Something went wrong, try again, please
ru: Что-то пошло не так, попробуйте еще раз, пожалуйста

source: Forecast for tomorrow
ru: Прогноз на завтра

source: <b>Forecast for %s</b> <i>Location: %s</i> Weather: %s Weather Description: %s Temperature: %s°C
ru: <b>Прогноз для %s</b> <i>Местоположение: %s</i> Погода: %s Описание погоды: %s Температура: %s°C

source: QR code
ru: QR-код

source: 🌦Weather
ru: 🌦Погода

source: 🎯Tasks
ru: 🎯Задачи

source: 🔐Generate password
ru: 🔐Сгенерировать пароль

source: 🔢Random number
ru: 🔢Случайное числоо

source: 🎮Entertainments
ru: 🎮Развлечения

source: ℹ️INFO
ru: ℹ️ИНФО

source: 📍Set your location
ru: 📍Установить свое местоположение

source: Dice🎲
ru: Кубик🎲

source: 💬Mailing
ru: 💬Рассылка

source: 👤Control User
ru: 👤Управление пользователями

source: Feedback💬
ru: Обратная связь💬

source: Answer💬
ru: Ответить💬

source: 🤖This bot with various functions as a TRPP project, here is a list of available functions: ️/start - start interaction with the bot QR code - generate a QR code 🔢Random number - generate a random number 🔐Generate password - generate a random password 🎯Tasks - create and schedule tasks 🌦Weather - view the weather 🎮Entertainments - the entertainment section *If you want to make an offer or ask a question, click the Feedback💬 button!*
ru: 🤖Этот бот с различными функциями в качестве проекта по ТРПП, вот список доступных функций: ️/start - начало взаимодействия с ботом QR-код - сгенерировать QR-код 🔢Случайное число - сгенерировать случайное число 🔐Сгенерировать пароль - сгенерировать надежный пароль 🎯Задачи - создать и планировать задачи 🌦Погода - посмотреть погоду 🎮Развлечения - секция развлечений 🖼️Убрать фон - удалить задний фон на фото *Хотите задать вопрос? Нажмите кнопку Обратная связь💬!*

source: Hello, this is the admin panel. 🪪Number of bot users: *{user_count}* Admin commands: /get\_users - download table with all users info
ru: Привет, это панель администратора. 🪪Количество пользователей бота: * {user_count} * Команды админа: /get _users-Скачать таблицу со всеми пользователями

source: *USER INFO* _Name_: *{user_name}* _ID_: *{user_id}* _Username_: *{user_username}* _Status_: *{status}*
ru: *Информация о пользователе * _имя_: * {user_name} * _ID_: *{user_id}* _ник_: * {user_username} * _Статус_: *{status}*

source: Mailing is complete!
ru: Рассылка завершена!

source: Starting mailing...
ru: Начинаю рассылку...

source: Enter the message to send:
ru: Введите сообщение для отправки:

source: This command cannot be used in a group!
ru: Эту команду нельзя использовать в группе!

source: Action canceled
ru: Действие отменено

source: 🚫You have been banned, contact @eckorezze for more information! Reason: {reason}
ru: 🚫Вы были заблокированы, свяжитесь с @eckorezze для получения дополнительной информации! Причина: {reason}

source: 🎉You have been unbanned!
ru: 🎉Вас разблокировали!

source: User {banned_user_id} successfully banned!
ru: Пользователь {banned_user_id} успешно забанен!

source: User {unbanned_user_id} successfully unbanned!
ru: Пользователь {unbanned_user_id} успешно разбанен!

source: *New message* from user: *{user}* *Message:* `{feedback_message}`
ru: *Новое сообщение* от пользователя: *{user}* *Сообщение:* `{feedback_message}`
